Revit 2024 API
FormatOptions Class
 Options for formatting numbers with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FormatOptions : IDisposable
Visual Basic
Public Class FormatOptions _
	Implements IDisposable
Visual C++
public ref class FormatOptions : IDisposable
Remarks
The FormatOptions class contains settings that control how to format numbers with units as strings. It contains those settings that are typically chosen by an end user in the Format dialog and stored in the document.
The FormatOptions class is used in two different ways. A FormatOptions object in the Units class represents the default settings for the document. A FormatOptions object used elsewhere represents settings that may optionally override the default settings.
The UseDefault property controls whether a FormatOptions object represents default or custom formatting. If UseDefault is true, formatting will be according to the default settings in the Units class, and none of the other settings in the object are meaningful. If UseDefault is false, the object contains custom settings that override the default settings in the Units class. UseDefault is always false for FormatOptions objects in the Units class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormatOptions
See Also
FormatOptions Members
Autodesk.Revit.DB Namespace